Repository: Andrulko/Ubuntu-Translation-Demo
Catalog: rosetta-eoan/*/LC_MESSAGES/libidn2.po
Languages: uk

source: success
uk: успішно

source: out of memory
uk: бракує пам’яті

source: could not determine locale encoding format
uk: не вдалося визначити формат кодування мови

source: could not convert string to UTF-8
uk: не вдалося перетворити рядок в UTF-8

source: string encoding error
uk: помилка кодування рядка

source: string could not be NFC normalized
uk: рядок не може бути нормалізований за NFC

source: string contains invalid punycode data
uk: рядок містить недійсні дані punycode

source: punycode encoded data will be too large
uk: дані з кодуванням punycode будуть занадто великими

source: punycode conversion resulted in overflow
uk: перетворення punycode призвело до переповнення

source: domain name longer than 255 characters
uk: доменне ім'я перевищує 255 символів

source: domain label longer than 63 characters
uk: мітка домену перевищує 63 символів

source: input A-label is not valid
uk: введення A-label неприпустиме

source: input A-label and U-label does not match
uk: введення A-label та U-label не збігається

source: string is not in Unicode NFC format
uk: рядок не є у форматі Unicode NFC

source: string contains forbidden two hyphens pattern
uk: рядок містить заборонені двохдефісні зразки

source: string start/ends with forbidden hyphen
uk: рядок починається/закінчується забороненим дефісом

source: string contains a forbidden leading combining character
uk: рядок містить заборонений провідний комбінаційний символ

source: string contains a disallowed character
uk: рядок містить заборонений символ

source: string contains a forbidden context-j character
uk: рядок містить заборонений символ context-j

source: string contains a context-j character with null rule
uk: рядок містить символ context-j з нульовим правилом

source: string contains a forbidden context-o character
uk: рядок містить заборонений символ context-o

source: string contains a context-o character with null rule
uk: рядок містить символ context-o з нульовим правилом

source: string contains unassigned code point
uk: рядок містить непризначену кодову точку

source: string has forbidden bi-directional properties
uk: рядок містить заборонені двонаправлені властивості

source: Unknown error
uk: Невідома помилка

source: Try `%s --help' for more information.
uk: Виконайте команду «%s --help», щоб дізнатися більше.

source: Usage: %s [OPTION]... [STRINGS]...
uk: Використання: %s [ПАРАМЕТР]... [РЯДКИ]...

source: Internationalized Domain Name (IDNA2008) convert STRINGS, or standard input.
uk: Інтернаціоналізоване доменне ім'я (IDNA2008) перетворює STRINGS, чи стандартне введення.

source: Command line interface to the Libidn2 implementation of IDNA2008. All strings are expected to be encoded in the locale charset. To process a string that starts with `-', for example `-foo', use `--' to signal the end of parameters, as in `idn2 --quiet -- -foo'. Mandatory arguments to long options are mandatory for short options too.
uk: Інтерфейс командного рядка до Libidn2 реалізації дляf IDNA2008. Програма вважає, що кодуванням всіх рядків є кодування локалі. Для обробки рядка, що починається з «-», наприклад, «-foo» додайте у команду «--» для позначення завершення параметрів. Приклад: «idn2 --quiet -a -- -foo». Обов’язкові аргументи для параметрів у розгорнутому записів є обов’язковими і для скорочених форм запису.

source: -h, --help Print help and exit -V, --version Print version and exit
uk: -h, --help вивести довідкові дані і завершити роботу -V, --version вивести дані щодо версії і завершити роботу

source: -d, --decode Decode (punycode) domain name -l, --lookup Lookup domain name (default) -r, --register Register label
uk: -d, --decode Декодувати (punycode) доменне ім'я -l, --lookup Знайти доменне ім'я (типове) -r, --register Зареєструвати позначку

source: -T, --tr46t Enable TR46 transitional processing -N, --tr46nt Enable TR46 non-transitional processing --no-tr46 Disable TR46 processing
uk: -T, --tr46t Увімкнути перехідну обробку TR46 -N, --tr46nt Увімкнути безперервну обробку TR46 --no-tr46 Вимкнути обробку TR46

source: Charset: %s
uk: Кодування: %s

source: Type each input string on a line by itself, terminated by a newline character.
uk: Виводити кожен рядок у окремому рядку, розділяти рядки символом нового рядка.

source: input error
uk: помилка у вхідних даних
